### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

## Throughout the notebook, I have left the templated answer in place and added sections for my code and answerset display

In [351]:
# Dependencies and Setup
import pandas as pd

# File to Load 
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load, encoding = "utf-8")

In [352]:
purchase_data.shape

(780, 7)

In [353]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [354]:
#count the unique number of starter players
purchase_data["SN"].count()

780

In [355]:
# 780 is not the right answer, so there must be duplicate entries on the player. 
# create a unique list of players
total_players = len(purchase_data["SN"].unique())
#add the unique list of players to a dataframe for display output purposes.
total_players_df = pd.DataFrame({"Total Players": [total_players]}) 
total_players_df

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [356]:
#calculate the number of unique items in the dataset
unique_items = len(purchase_data["Item ID"].unique())
#calculate the average price of all items
average_price = purchase_data["Price"].mean()
#calculate the number of purchases
num_of_purchases = purchase_data["Purchase ID"].count()
#calculate the total revenue
total_rev = purchase_data["Price"].sum()
#add the calculations to a dataframe

analysis_df = pd.DataFrame({"Number of Unique Items": [unique_items],
                            "Average Price": [average_price],
                            "Number of Purchases": [num_of_purchases],
                            "Total Revenue": [total_rev]})
#format the display of financial data with decimals and $
analysis_df["Average Price"] = analysis_df["Average Price"].map("${:.2f}".format)
analysis_df["Total Revenue"] = analysis_df["Total Revenue"].map("${:,.2f}".format)
#display the final answer
analysis_df

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780     $2,379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [357]:
#list the gender values in the dataset
purchase_data["Gender"].value_counts()

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [358]:
#there are 3 genders and the total SN contain duplicates so we will need to compute on unique values of SN
#count # of males
male_count = purchase_data.loc[purchase_data["Gender"] == "Male",:]
male_count_unique = len(male_count["SN"].unique())
#print(male_count_unique)   
#print(total_players)
male_percent = (male_count_unique/total_players)*100
print(male_percent)

84.02777777777779

In [359]:
#count # of females
female_count = purchase_data.loc[purchase_data["Gender"] == "Female",:]
female_count_unique = len(female_count["SN"].unique())
print(female_count_unique) 
female_percent = (female_count_unique/total_players)*100
print(female_percent)

#count # of non-disclosed/other
other_count = purchase_data.loc[purchase_data["Gender"] == "Other / Non-Disclosed",:]
other_count_unique = len(other_count["SN"].unique())
print(other_count_unique)
other_percent = (other_count_unique/total_players)*100
print(other_percent)

81
14.0625
11
1.9097222222222223

In [360]:
gender_df = pd.DataFrame({"Gender": ["Male", "Female", "Other / Non-Disclosed"],
                          "Total Count": [male_count_unique, female_count_unique, other_count_unique],
                            "Percentage of Players": [male_percent, female_percent, other_percent]
                        })
gender_df_indexed = gender_df.set_index("Gender")
gender_df_indexed["Percentage of Players"] = gender_df_indexed["Percentage of Players"].map("{:.2f}%".format)

gender_df_indexed

                       Total Count Percentage of Players
Gender
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [361]:
#create a data frame grouped by gender
grouped_purchase_df = purchase_data.groupby(["Gender"])
grouped_purchase_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
9,9,Chanosian48,35,Other / Non-Disclosed,136,Ghastly Adamantite Protector,3.58
15,15,Lisassa64,21,Female,98,"Deadline, Voice Of Subtlety",2.89
18,18,Reunasu60,22,Female,82,Nirvana,4.90
22,22,Siarithria38,38,Other / Non-Disclosed,24,Warped Fetish,3.81
38,38,Reulae52,10,Female,116,Renewed Skeletal Katana,4.18
41,41,Assosia88,20,Female,7,"Thorn, Satchel of Dark Souls",1.33
55,55,Phaelap26,25,Female,84,Arcane Gem,3.79
82,82,Haerithp41,16,Other / Non-Disclosed,160,Azurewrath,4.40
111,111,Sundim98,21,Other / Non-Disclosed,41,Orbit,4.75
228,228,Jiskirran77,20,Other / Non-Disclosed,80,Dreamsong,3.39

In [362]:
#purchase count by gender
gender_purchase_count = grouped_purchase_df["Purchase ID"].count()
gender_purchase_count

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase ID, dtype: int64

In [363]:
#avg purchase price by gender
gender_avg_purchase_price = grouped_purchase_df["Price"].mean()
gender_avg_purchase_price

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [364]:
#total purchase value by gender
gender_total_purchase_value = grouped_purchase_df["Price"].sum()
gender_total_purchase_value

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [365]:
#avg. purchase total by person by gender

In [366]:
#create a data frame grouped by gender, then person
grouped_gender_person_df = purchase_data.groupby(["Gender", "SN"])
grouped_gender_person_df.count().head()

                      Purchase ID  Age  Item ID  Item Name  Price
Gender SN
Female Adastirin33              1    1        1          1      1
       Aerithllora36            2    2        2          2      2
       Aethedru70               1    1        1          1      1
       Aidain51                 1    1        1          1      1
       Aiduesu86                1    1        1          1      1

In [367]:
total_by_person = pd.DataFrame(grouped_gender_person_df["Price"].sum())
total_by_person.head()

                      Price
Gender SN
Female Adastirin33     4.48
       Aerithllora36   8.64
       Aethedru70      3.54
       Aidain51        3.45
       Aiduesu86       4.48

In [368]:
avg_purchase_total = total_by_person.groupby(level="Gender").mean()
avg_purchase_total

                          Price
Gender
Female                 4.468395
Male                   4.065372
Other / Non-Disclosed  4.562727

In [369]:
#create summary data frame to hold results
purchasing_analysis_df = pd.DataFrame({"Purchase Count": gender_purchase_count,
                                       "Average Purchase Price": gender_avg_purchase_price,
                                       "Total Purchase Value": gender_total_purchase_value,
                                                                 
                        })
purchasing_analysis_df["Avg Total Purchase per Person"]= avg_purchase_total 
#"Avg Total Purchase per Person":[avg_purchase_total]    
#format results
#gender_df_indexed = gender_df.set_index("Gender")
purchasing_analysis_df["Average Purchase Price"] = purchasing_analysis_df["Average Purchase Price"].map("${:.2f}".format)
purchasing_analysis_df["Total Purchase Value"] = purchasing_analysis_df["Total Purchase Value"].map("${:.2f}".format)
purchasing_analysis_df["Avg Total Purchase per Person"] = purchasing_analysis_df["Avg Total Purchase per Person"].map("${:.2f}".format)

#display dataframe
purchasing_analysis_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,$1967.64,$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [370]:
#Think about what the best bins would be for age
purchase_data.describe()

       Purchase ID         Age     Item ID       Price
count   780.000000  780.000000  780.000000  780.000000
mean    389.500000   22.714103   91.755128    3.050987
std     225.310896    6.659444   52.697702    1.169549
min       0.000000    7.000000    0.000000    1.000000
25%     194.750000   20.000000   47.750000    1.980000
50%     389.500000   22.000000   92.000000    3.150000
75%     584.250000   25.000000  138.000000    4.080000
max     779.000000   45.000000  183.000000    4.990000

In [374]:
#create the bins in which data will be held
bins = [0,9,14,19,24,29,34,39,50]
#create the names for the bins
labelnames = ["<10", "10-14", "15-19","20-24", "25-29","30-34", "35-39","40+"]

In [372]:
#I finally figured out how to create the master data set with duplicates removed!!!!
unique_df = purchase_data
df_duplicates_removed = pd.DataFrame.drop_duplicates(unique_df, subset = "SN")
print(df_duplicates_removed)
unique_df = df_duplicates_removed

     Purchase ID             SN  Age  Gender  Item ID  \
0              0        Lisim78   20    Male      108
1              1    Lisovynya38   40    Male      143
2              2     Ithergue48   24    Male       92
3              3  Chamassasya86   24    Male      100
4              4      Iskosia90   23    Male      131
..           ...            ...  ...     ...      ...
773          773         Hala31   21    Male       19
774          774     Jiskjask80   11    Male       92
775          775     Aethedru70   21  Female       60
777          777     Yathecal72   20    Male       67
778          778        Sisur91    7    Male       92

                                     Item Name  Price
0    Extraction, Quickblade Of Trembling Hands   3.53
1                            Frenzied Scimitar   1.56
2                                 Final Critic   4.88
3                                  Blindscythe   3.27
4                                         Fury   1.44
..                                         ...    ...
773              Pursuit, Cudgel of Necromancy   1.02
774                               Final Critic   4.19
775                                       Wolf   3.54
777      Celeste, Incarnation of the Corrupted   3.46
778                               Final Critic   4.19

[576 rows x 7 columns]

In [375]:
#Categorize the existing players using the age bins. Hint: use pd.cut()
#make a copy of the unique purchase data so we don't mess up other calculations
age_summary_df = unique_df
age_summary_df.head()
#categorize the data
age_summary_df["Age Summary"]=pd.cut(age_summary_df["Age"], bins, labels= labelnames, include_lowest = True)
age_summary_df

<ipython-input-375-5deb171edeb9>:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  age_summary_df["Age Summary"]=pd.cut(age_summary_df["Age"], bins, labels= labelnames, include_lowest = True)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Summary
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
773,773,Hala31,21,Male,19,"Pursuit, Cudgel of Necromancy",1.02,20-24
774,774,Jiskjask80,11,Male,92,Final Critic,4.19,10-14
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10

In [376]:
age_group = age_summary_df.groupby(["Age Summary"])

age_group["Gender"].count().head()

Age Summary
<10       17
10-14     22
15-19    107
20-24    258
25-29     77
Name: Gender, dtype: int64

In [377]:
count_of_group = age_group["Gender"].count()

In [378]:
percent_of_group = (age_group["Gender"].count()/total_players)*100

In [379]:
age_demographics_df = pd.DataFrame({"Total Count": count_of_group,
                                       "Percentage of Players": percent_of_group
                                      
                                                                 
                        })
age_demographics_df["Percentage of Players"] = age_demographics_df["Percentage of Players"].map("{:.2f}%".format)

In [380]:
age_demographics_df

             Total Count Percentage of Players
Age Summary
<10                   17                 2.95%
10-14                 22                 3.82%
15-19                107                18.58%
20-24                258                44.79%
25-29                 77                13.37%
30-34                 52                 9.03%
35-39                 31                 5.38%
40+                   12                 2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [381]:
#Bin the purchase_data data frame by age
purchase_data["Age Summary"]=pd.cut(purchase_data["Age"], bins, labels= labels, include_lowest = True)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Summary
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [382]:
#Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below

purchase_age_group = purchase_data.groupby(["Age Summary"])
purchase_count = purchase_age_group["Purchase ID"].count()
purchase_count

Age Summary
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Purchase ID, dtype: int64

In [383]:
avg_purchase_price_age_group = purchase_age_group["Price"].mean()
avg_purchase_price_age_group

Age Summary
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Price, dtype: float64

In [384]:
#this section uses the same logic as previous section calculating by gender, replacing age summary for gender
grouped_age_summary__SN = purchase_data.groupby(["Age Summary", "SN"])
grouped_age_summary__SN.count().head()
grouped_age_summary_SN_total_by_person = pd.DataFrame(grouped_age_summary__SN["Price"].sum())
grouped_age_summary_SN_total_by_person.head()

gassn_avg_purchase_total = grouped_age_summary_SN_total_by_person.groupby(level="Age Summary").mean()
gassn_avg_purchase_total

                Price
Age Summary
<10          4.537059
10-14        3.762727
15-19        3.858785
20-24        4.318062
25-29        3.805195
30-34        4.115385
35-39        4.763548
40+          3.186667

In [385]:
#total purchase value per age group
tot_purchase_price_age_group = purchase_age_group["Price"].sum()
tot_purchase_price_age_group

Age Summary
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [386]:
#Create a summary data frame to hold the results
purchasing_analysis_age_df = pd.DataFrame({"Purchase Count": purchase_count,
                                           "Average Purchase Price": avg_purchase_price_age_group,
                                           "Total Purchase Value": tot_purchase_price_age_group                              
                                        })
purchasing_analysis_age_df["Avg Total Purchase per Person"]= gassn_avg_purchase_total

#Optional: give the displayed data cleaner formatting
purchasing_analysis_age_df["Average Purchase Price"] = purchasing_analysis_age_df["Average Purchase Price"].map("${:.2f}".format)
purchasing_analysis_age_df["Total Purchase Value"] = purchasing_analysis_age_df["Total Purchase Value"].map("${:,.2f}".format)
purchasing_analysis_age_df["Avg Total Purchase per Person"] = purchasing_analysis_age_df["Avg Total Purchase per Person"].map("${:.2f}".format)    
    
#Display the summary data frame
purchasing_analysis_age_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Summary,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [394]:
#Assignment:
    #Run basic calculations to obtain the results in the table below
    #Purchase Count	Average Purchase Price	Total Purchase Value by SN for the top 5 spenders

In [395]:
#logic:
    #create a dataframe that includes the total count, avg purchase price and total purchsae vale by SN

    #sort teh data frame by biggest spender (total purchase value)
    #clean the format
    #display

In [396]:
 #create a dataframe that includes the total count, avg purchase price and total purchsae vale by SN
#purchase_data.describe()
purchase_data.head()
SN_purchase_data = purchase_data.groupby(["SN"])
#each person is identified by a SN
#Calculate how many items each person purchased
SN_total_count = SN_purchase_data["Purchase ID"].count()
SN_total_count

SN
Adairialis76     1
Adastirin33      1
Aeda94           1
Aela59           1
Aelaria33        1
                ..
Yathecal82       3
Yathedeu43       2
Yoishirrala98    1
Zhisrisu83       2
Zontibe81        3
Name: Purchase ID, Length: 576, dtype: int64

In [397]:
#calculate the average purchase price per person
avg_purch_price = SN_purchase_data["Price"].mean()

In [398]:
#calculate the total purchase value per person
tot_purch_value = SN_purchase_data["Price"].sum()

In [399]:
#build a dataframe to hold the calculations per person
SN_df = pd.DataFrame({"Purchase Count": SN_total_count,
                      "Average Purchase Price": avg_purch_price,
                      "Total Purchase Value": tot_purch_value                              
                      })
SN_df

               Purchase Count  Average Purchase Price  Total Purchase Value
SN
Adairialis76                1                2.280000                  2.28
Adastirin33                 1                4.480000                  4.48
Aeda94                      1                4.910000                  4.91
Aela59                      1                4.320000                  4.32
Aelaria33                   1                1.790000                  1.79
...                       ...                     ...                   ...
Yathecal82                  3                2.073333                  6.22
Yathedeu43                  2                3.010000                  6.02
Yoishirrala98               1                4.580000                  4.58
Zhisrisu83                  2                3.945000                  7.89
Zontibe81                   3                2.676667                  8.03

[576 rows x 3 columns]

In [400]:
#sort the SN dataframe by top spender (total purchase value decreasing)
SN_sorted = SN_df.sort_values("Total Purchase Value", ascending=False)
SN_sorted

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10
...                     ...                     ...                   ...
Ililsasya43               1                1.020000                  1.02
Irilis75                  1                1.020000                  1.02
Aidai61                   1                1.010000                  1.01
Chanirra79                1                1.010000                  1.01
Alo38                     1                1.000000                  1.00

[576 rows x 3 columns]

In [401]:
#Optional: give the displayed data cleaner formatting
SN_sorted["Average Purchase Price"] = SN_sorted["Average Purchase Price"].map("${:.2f}".format)
SN_sorted["Total Purchase Value"] = SN_sorted["Total Purchase Value"].map("${:,.2f}".format)
   
#Display the summary data frame
SN_sorted

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10
...                     ...                    ...                  ...
Ililsasya43               1                  $1.02                $1.02
Irilis75                  1                  $1.02                $1.02
Aidai61                   1                  $1.01                $1.01
Chanirra79                1                  $1.01                $1.01
Alo38                     1                  $1.00                $1.00

[576 rows x 3 columns]

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [ ]:
#Most popular items
#Retrieve the Item ID, Item Name, and Item Price columns
#Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value

Item_purchase_data = purchase_data.groupby(["Item ID"])
#each item is identified by an item id
#Calculate how many of each item were purchased
Item_total_count = Item_purchase_data["Purchase ID"].count()
SN_total_count

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame